namespace BankCode;

public static class BankCodeDictionary
{
    // 定義數字
    public static Dictionary<string, char> DigitPatterns = new()
    {
        {
            " _ " +
            "| |" +
            "|_|",
            '0'
        },

        {
            "   " +
            "  |" +
            "  |",
            '1'
        },

        {
            " _ " +
            " _|" +
            "|_ ",
            '2'
        },

        {
            " _ " +
            " _|" +
            " _|",
            '3'
        },

        {
            "   " +
            "|_|" +
            "  |",
            '4'
        },

        {
            " _ " +
            "|_ " +
            " _|",
            '5'
        },

        {
            " _ " +
            "|_ " +
            "|_|",
            '6'
        },

        {
            " _ " +
            "  |" +
            "  |",
            '7'
        },

        {
            " _ " +
            "|_|" +
            "|_|",
            '8'
        },

        {
            " _ " +
            "|_|" +
            " _|",
            '9'
        }
    };
    
    // 定義修復
    public static readonly Dictionary<char, char[]> DigitNeighbors = new()
    {
        { '0', new[] { '8' } },          // 補中中的 _ → 8
        { '1', new[] { '7' } },          // 補上中的 _ → 7
        { '2', new char[] { } },         // 加減一條都不合法 → 無
        { '3', new[] { '9' } },          // 補中左的 | → 9
        { '4', new char[] { } },         // 加減一條都不合法 → 無
        { '5', new[] { '6', '9' } },     // 補下左 | → 6；補中右 | → 9
        { '6', new[] { '5', '8' } },     // 減下左 | → 5；補中中 _ → 8
        { '7', new[] { '1' } },          // 減上中 _ → 1
        { '8', new[] { '0', '6', '9' } },// 減中中→0；減中右→6；減下左→9
        { '9', new[] { '3', '5', '8' } },// 減中左→3；減中右→5；補下左→8
    };
}