namespace BankCode;

public static class BankCodeDictionary
{
    // 定義數字
    public static Dictionary<string, char> DigitPatterns = new()
    {
        {
            " _ " +
            "| |" +
            "|_|",
            '0'
        },

        {
            "   " +
            "  |" +
            "  |",
            '1'
        },

        {
            " _ " +
            " _|" +
            "|_ ",
            '2'
        },

        {
            " _ " +
            " _|" +
            " _|",
            '3'
        },

        {
            "   " +
            "|_|" +
            "  |",
            '4'
        },

        {
            " _ " +
            "|_ " +
            " _|",
            '5'
        },

        {
            " _ " +
            "|_ " +
            "|_|",
            '6'
        },

        {
            " _ " +
            "  |" +
            "  |",
            '7'
        },

        {
            " _ " +
            "|_|" +
            "|_|",
            '8'
        },

        {
            " _ " +
            "|_|" +
            " _|",
            '9'
        }
    };

    // 嘗試通過添加/移除單一管線 (`|`) 或底線 (`_`) 來修正錯誤
    public static Dictionary<char, string[]> DigitLikePatterns = new Dictionary<char, string[]>
    {
        //  " _ " + "| |" + "|_|", // 原始
        {
            '0',
            new string[]
            {
                "   " + "| |" + "|_|", // 移除頂部底線
                " _ " + "  |" + "|_|", // 移除左側管線
                " _ " + "| |" + "   ", // 移除底部底線
                " _ " + "|  " + "|_|" // 移除右側管線
            }
        },
        {
            '1',
            new string[]
            {
                "   " + "   " + "  |", // 移除上方管線
                "   " + "  |" + "   ", // 移除下方管線
                "   " + "   " + "   ", // 移除兩條管線
            }
        },
        {
            '2',
            new string[]
            {
                "   " + " _|" + "|_ ", // 移除頂部底線
                " _ " + "   " + "|_ ", // 移除右側管線
                " _ " + " _|" + "   ", // 移除底部底線
                " _ " + "  |" + "|_ " // 移除中間底線
            }
        },
        {
            '3',
            new string[]
            {
                "   " + " _|" + " _|", // 移除頂部底線
                " _ " + "   " + " _|", // 移除上方右側管線
                " _ " + " _|" + "   ", // 移除底部底線
                " _ " + "  |" + " _|" // 移除中間底線
            }
        },
        {
            '4',
            new string[]
            {
                "   " + "|_|" + "  |", // 移除頂部底線
                " _ " + "| |" + "  |", // 移除中間底線
                " _ " + "|_ " + "  |", // 移除右側上方管線
                " _ " + "  |" + "  |" // 移除左側管線
            }
        },
        {
            '5',
            new string[]
            {
                "   " + "|_ " + " _|", // 移除頂部底線
                " _ " + "   " + " _|", // 移除左側管線
                " _ " + "|_ " + "   ", // 移除底部底線
                " _ " + "| |" + " _|" // 添加左下管線
            }
        },
        {
            '6',
            new string[]
            {
                "   " + "|_ " + "|_|", // 移除頂部底線
                " _ " + "   " + "|_|", // 移除左上管線
                " _ " + "|_ " + "| |", // 移除底部底線
                " _ " + "| |" + "|_|" // 移除中間底線
            }
        },
        {
            '7',
            new string[]
            {
                "   " + "  |" + "  |", // 移除頂部底線
                " _ " + "   " + "  |", // 移除上方管線
                " _ " + "  |" + "   " // 移除下方管線
            }
        },
        {
            '8',
            new string[]
            {
                "   " + "|_|" + "|_|", // 移除頂部底線
                " _ " + "| |" + "|_|", // 移除中間底線
                " _ " + "|_|" + "| |", // 移除底部底線
                " _ " + "  |" + "|_|", // 移除左上管線
                " _ " + "|  " + "|_|" // 移除右上管線
            }
        },
        {
            '9',
            new string[]
            {
                "   " + "|_|" + " _|", // 移除頂部底線
                " _ " + "| |" + " _|", // 移除中間底線
                " _ " + "|_|" + "   ", // 移除底部底線
                " _ " + "|_ " + " _|", // 移除右下管線
                " _ " + "  |" + " _|" // 移除左上管線
            }
        }
    };
}